---
kind: other
id: Properties.T:Autodesk.Revit.DB.SKPImportOptions
source: html/f804a87a-17c5-24aa-86cc-69ff611673c4.htm
---
# SKPImportOptions Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.